[Killed] LogicalNot
Controllers/TaskController.php:73:9
 
     public function editTask($id, $data)
     {
-        if (empty($data['title']) || empty($data['description']) || !isset($data['category_id'])) {
+        if (empty($data['title']) || empty($data['description']) || isset($data['category_id'])) {
             $_SESSION['error'] = "Faltan datos para actualizar la tarea."; // Error si faltan datos
             $this->redirectTo('/dashboard');
killedBy: Tests\Functional\TaskControllerTest::testEditTaskWithValidData
statusReason: 1) Tests\Functional\TaskControllerTest::testEditTaskWithValidData
Failed asserting that false is true.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Functional\TaskControllerTest.php:142

FAILURES!
Tests: 4, Assertions: 10, Failures: 1.
