[Killed] LogicalOrNegation
Controllers/AuthController.php:81:9
     // Procesar registro de usuario
     public function register($data)
     {
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if (!(empty($data['name']) || empty($data['email']) || empty($data['password']))) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/register');
killedBy: Tests\Functional\AuthControllerTest::testRegisterWithValidData
statusReason: 1) Tests\Functional\AuthControllerTest::testRegisterWithValidData
Failed asserting that false is true.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Functional\AuthControllerTest.php:132

FAILURES!
Tests: 4, Assertions: 10, Failures: 1.

[Killed] LogicalOrAllSubExprNegation
Controllers/AuthController.php:81:9
     // Procesar registro de usuario
     public function register($data)
     {
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if (!empty($data['name']) || !empty($data['email']) || !empty($data['password'])) {
             $_SESSION['error'] = "Por favor, complete todos los campos.";
             $this->redirectTo('/register');
killedBy: Tests\Functional\AuthControllerTest::testRegisterWithValidData
statusReason: 1) Tests\Functional\AuthControllerTest::testRegisterWithValidData
Failed asserting that false is true.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Functional\AuthControllerTest.php:132

FAILURES!
Tests: 4, Assertions: 10, Failures: 1.
