[Killed] LogicalNot
Models/Database.php:16:9
     {
         $config = include __DIR__ . '/../../config/database.php';
     
-        if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
+        if (empty($config['host']) || empty($config['db']) || empty($config['user']) || isset($config['pass'])) {
             throw new \InvalidArgumentException("Invalid database configuration.");
         }
killedBy: Tests\Unit\NotificationModelTest::testCreateNotificationSuccess
statusReason: 1) Tests\Unit\NotificationModelTest::testCreateNotificationSuccess
InvalidArgumentException: Invalid database configuration.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\app\Models\Database.php:14
C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Unit\NotificationModelTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Erro

[Killed] LogicalOrAllSubExprNegation
Models/Database.php:16:9
     {
         $config = include __DIR__ . '/../../config/database.php';
     
-        if (empty($config['host']) || empty($config['db']) || empty($config['user']) || !isset($config['pass'])) {
+        if (!empty($config['host']) || !empty($config['db']) || !empty($config['user']) || isset($config['pass'])) {
             throw new \InvalidArgumentException("Invalid database configuration.");
         }
killedBy: Tests\Unit\NotificationModelTest::testCreateNotificationSuccess
statusReason: 1) Tests\Unit\NotificationModelTest::testCreateNotificationSuccess
InvalidArgumentException: Invalid database configuration.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\app\Models\Database.php:14
C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Unit\NotificationModelTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Erro
