[Killed] LogicalOrNegation
Models/UserModel.php:21:9
     public function createUser($data)
     {
         // Verificar si los campos obligatorios están presentes
-        if (empty($data['name']) || empty($data['email']) || empty($data['password'])) {
+        if (!(empty($data['name']) || empty($data['email']) || empty($data['password']))) {
             return false; // Retornar false si falta algún campo
         }
killedBy: Tests\Unit\UserModelTest::testCreateUser
statusReason: 1) Tests\Unit\UserModelTest::testCreateUser
Failed asserting that false is true.

C:\Users\TheGoat\Desktop\clone\proyecto-si784-2024-ii-u2-ayma_tapia_poma\project\tests\Unit\UserModelTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
